# DataFrame
### combination of multiple Series

In [2]:
import numpy as np
import pandas as pd

In [4]:
#creating a data Frame from a Dictionary
data={
    'name':['Prakash','Ashrita','Sanjay','Ravi'],
    'age':[21,20,23,20],
    'city':['Bhubaneswar','Cuttack','Banglore','Delhi'],
    'salary':[30000,20000,50000,40000]
}
pd.DataFrame(data)

      name  age         city  salary
0  Prakash   21  Bhubaneswar   30000
1  Ashrita   20      Cuttack   20000
2   Sanjay   23     Banglore   50000
3     Ravi   20        Delhi   40000

In [7]:
#Create a DataFrame by List
list=[
    ['prakash',20,30000,'Bhubaneswar'],
    ['Ashu',21,20000,'Cuttacuk'],
    ['Sanjay',23,50000,'Banglore'],
    ['Ravi',20,40000,'Delhi']
]

df=pd.DataFrame(list) # here we can not set our row and columns names.
df

         0   1      2            3
0  prakash  20  30000  Bhubaneswar
1     Ashu  21  20000     Cuttacuk
2   Sanjay  23  50000     Banglore
3     Ravi  20  40000        Delhi

In [ ]:
# We can set column names manually by proving one argument containg all column names 
column=['Name',"Age","Salary","City"]
df=pd.DataFrame(list,columns=column)
df

      Name  Age  Salary         City
0  prakash   20   30000  Bhubaneswar
1     Ashu   21   20000     Cuttacuk
2   Sanjay   23   50000     Banglore
3     Ravi   20   40000        Delhi

# Selection and Indexing of columns

In [ ]:
df['City'] # single column

0    Bhubaneswar
1       Cuttacuk
2       Banglore
3          Delhi
Name: City, dtype: object

In [ ]:
df[['City','Salary']] #more than one column

          City  Salary
0  Bhubaneswar   30000
1     Cuttacuk   20000
2     Banglore   50000
3        Delhi   40000

## Creating a new column

In [35]:
df['Designation']=["ML Eng.","Nurse","Entraprenuer","Doctor"]

In [36]:
df

      Name  Age  Salary         City   Designation
0  prakash   20   30000  Bhubaneswar       ML Eng.
1     Ashu   21   20000     Cuttacuk         Nurse
2   Sanjay   23   50000     Banglore  Entraprenuer
3     Ravi   20   40000        Delhi        Doctor

## Remove Column

In [37]:
df.drop('Designation') # if we don't write the Axis then bydefault it's 0 . So here error will come because in axis 0 "Designation" is not there

KeyError: "['Designation'] not found in axis"

In [34]:
# we should write the axis 
df.drop('Designation',axis=1)

KeyError: "['Designation'] not found in axis"

In [38]:
df # After drop fun we see the 'Designation' column again came . 
# THis is because drop create a copy of main df .

      Name  Age  Salary         City   Designation
0  prakash   20   30000  Bhubaneswar       ML Eng.
1     Ashu   21   20000     Cuttacuk         Nurse
2   Sanjay   23   50000     Banglore  Entraprenuer
3     Ravi   20   40000        Delhi        Doctor

In [39]:
# so to permanetly delete any column we use another keyword 'inplace=True'
df.drop('Designation',axis=1,inplace=True)

In [40]:
df

      Name  Age  Salary         City
0  prakash   20   30000  Bhubaneswar
1     Ashu   21   20000     Cuttacuk
2   Sanjay   23   50000     Banglore
3     Ravi   20   40000        Delhi

In [41]:
# we can delete multiple columns 
df.drop(['Age','Salary'],axis=1)

      Name         City
0  prakash  Bhubaneswar
1     Ashu     Cuttacuk
2   Sanjay     Banglore
3     Ravi        Delhi

## Delete a row

In [ ]:
df.drop(0,axis=0) # Here the 1st row will be deleted

     Name  Age  Salary      City
1    Ashu   21   20000  Cuttacuk
2  Sanjay   23   50000  Banglore
3    Ravi   20   40000     Delhi

### Selecting Row

In [43]:
df.loc[0]

Name          prakash
Age                20
Salary          30000
City      Bhubaneswar
Name: 0, dtype: object

In [45]:
df.loc[[0,1]]

      Name  Age  Salary         City
0  prakash   20   30000  Bhubaneswar
1     Ashu   21   20000     Cuttacuk

In [46]:
df.iloc[0]

Name          prakash
Age                20
Salary          30000
City      Bhubaneswar
Name: 0, dtype: object

### Selecting Subsets rows and sub columns

In [50]:
df.loc[[0,1]][['City','Salary']]

          City  Salary
0  Bhubaneswar   30000
1     Cuttacuk   20000

In [51]:
df.loc[[2,3]][['Name','Age']]

     Name  Age
2  Sanjay   23
3    Ravi   20

### conditional Selection

In [52]:
df

      Name  Age  Salary         City
0  prakash   20   30000  Bhubaneswar
1     Ashu   21   20000     Cuttacuk
2   Sanjay   23   50000     Banglore
3     Ravi   20   40000        Delhi

In [54]:
df[df['Age']>22]

     Name  Age  Salary      City
2  Sanjay   23   50000  Banglore

In [57]:
# Select only those age > 20 and City = Bhubaneswar

df[(df['Age']>20 )& (df['City']=='Bhubaneswar')]

Empty DataFrame
Columns: [Name, Age, Salary, City]
Index: []

### Finding Missing Data

In [1]:
import numpy as np
import pandas as pd

In [7]:
Data={
    'A':[1,2,np.nan,4.5],
    'B':[5,np.nan,np.nan,8],
    'C':[10,11,12,np.nan],
    'D':['a','b',np.nan,'d']
}
df=pd.DataFrame(Data)

In [8]:
df

     A    B     C    D
0  1.0  5.0  10.0    a
1  2.0  NaN  11.0    b
2  NaN  NaN  12.0  NaN
3  4.5  8.0   NaN    d

In [9]:
# To check the null values in the dataframe
df.isnull()

       A      B      C      D
0  False  False  False  False
1  False   True  False  False
2   True   True  False   True
3  False  False   True  False

In [10]:
#To count the null values in each column
df.isnull().sum()

A    1
B    2
C    1
D    1
dtype: int64

### Removing the Null Values 
###### It will be row wise

In [11]:
df

     A    B     C    D
0  1.0  5.0  10.0    a
1  2.0  NaN  11.0    b
2  NaN  NaN  12.0  NaN
3  4.5  8.0   NaN    d

In [12]:
df.dropna() # it will remove all the rows containing null values

     A    B     C  D
0  1.0  5.0  10.0  a

In [13]:
df.dropna(thresh=3) # it will keep the rows which have atleast 3 non null values

     A    B     C  D
0  1.0  5.0  10.0  a
1  2.0  NaN  11.0  b
3  4.5  8.0   NaN  d

### Filling the Missing Values

In [14]:
df.fillna(0) # it will fill all the null values with 0

     A    B     C  D
0  1.0  5.0  10.0  a
1  2.0  0.0  11.0  b
2  0.0  0.0  12.0  0
3  4.5  8.0   0.0  d

In [ ]:
values={'A':0,'B':100,'C':200,'D':'400'}
df.fillna(values)

     A      B      C    D
0  1.0    5.0   10.0    a
1  2.0  100.0   11.0    b
2  0.0  100.0   12.0  400
3  4.5    8.0  200.0    d